cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
            <register>
                  <name>RTCPS0CTL</name>
                  <displayName>PS0CTL</displayName>
                  <description>Real-Time Clock Prescale Timer 0 Control Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>RT0PSIFG</name>
                        <description>Prescale timer 0 interrupt flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RT0PSIFG_0</name>
                                <description>No time event occurred</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT0PSIFG_1</name>
                                <description>Time event occurred</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RT0PSIE</name>
                        <description>Prescale timer 0 interrupt enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RT0PSIE_0</name>
                                <description>Interrupt not enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT0PSIE_1</name>
                                <description>Interrupt enabled (LPM3/LPM3.5 wake-up enabled)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RT0IP</name>
                        <description>Prescale timer 0 interrupt interval</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RT0IP_0</name>
                                <description>Divide by 2</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT0IP_1</name>
                                <description>Divide by 4</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT0IP_2</name>
                                <description>Divide by 8</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT0IP_3</name>
                                <description>Divide by 16</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT0IP_4</name>
                                <description>Divide by 32</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT0IP_5</name>
                                <description>Divide by 64</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT0IP_6</name>
                                <description>Divide by 128</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT0IP_7</name>
                                <description>Divide by 256</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCPS1CTL</name>
                  <displayName>PS1CTL</displayName>
                  <description>Real-Time Clock Prescale Timer 1 Control Register</description>
                  <addressOffset>0xA</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>RT1PSIFG</name>
                        <description>Prescale timer 1 interrupt flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RT1PSIFG_0</name>
                                <description>No time event occurred</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT1PSIFG_1</name>
                                <description>Time event occurred</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RT1PSIE</name>
                        <description>Prescale timer 1 interrupt enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RT1PSIE_0</name>
                                <description>Interrupt not enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT1PSIE_1</name>
                                <description>Interrupt enabled (LPM3/LPM3.5 wake-up enabled)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RT1IP</name>
                        <description>Prescale timer 1 interrupt interval</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RT1IP_0</name>
                                <description>Divide by 2</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT1IP_1</name>
                                <description>Divide by 4</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT1IP_2</name>
                                <description>Divide by 8</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT1IP_3</name>
                                <description>Divide by 16</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT1IP_4</name>
                                <description>Divide by 32</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT1IP_5</name>
                                <description>Divide by 64</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT1IP_6</name>
                                <description>Divide by 128</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RT1IP_7</name>
                                <description>Divide by 256</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCPS</name>
                  <displayName>PS</displayName>
                  <description>Real-Time Clock Prescale Timer Counter Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>RT0PS</name>
                        <description>Prescale timer 0 counter value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RT1PS</name>
                        <description>Prescale timer 1 counter value</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCIV</name>
                  <displayName>IV</displayName>
                  <description>Real-Time Clock Interrupt Vector Register</description>
                  <addressOffset>0xE</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>RTCIV</name>
                        <description>Real-time clock interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>RTCIV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>RTCIV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCIV_2</name>
                                <description>Interrupt Source: RTC oscillator failure; Interrupt Flag: RTCOFIFG; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCIV_4</name>
                                <description>Interrupt Source: RTC ready; Interrupt Flag: RTCRDYIFG</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCIV_6</name>
                                <description>Interrupt Source: RTC interval timer; Interrupt Flag: RTCTEVIFG</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCIV_8</name>
                                <description>Interrupt Source: RTC user alarm; Interrupt Flag: RTCAIFG</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCIV_10</name>
                                <description>Interrupt Source: RTC prescaler 0; Interrupt Flag: RT0PSIFG</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RTCIV_12</name>
                                <description>Interrupt Source: RTC prescaler 1; Interrupt Flag: RT1PSIFG</description>
                                <value>12</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCTIM0</name>
                  <displayName>TIM0</displayName>
                  <description>RTCTIM0 Register  Hexadecimal Format</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000c0c0</resetMask>
                  <fields>
                    <field>
                        <name>Seconds</name>
                        <description>Seconds (0 to 59)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x6</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>Minutes</name>
                        <description>Minutes (0 to 59)</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x6</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCTIM1</name>
                  <displayName>TIM1</displayName>
                  <description>Real-Time Clock Hour, Day of Week</description>
                  <addressOffset>0x12</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000f8e0</resetMask>
                  <fields>
                    <field>
                        <name>Hours</name>
                        <description>Hours (0 to 23)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DayofWeek</name>
                        <description>Day of week (0 to 6)</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCDATE</name>
                  <displayName>DATE</displayName>
                  <description>RTCDATE - Hexadecimal Format</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000f0e0</resetMask>
                  <fields>
                    <field>
                        <name>Day</name>
                        <description>Day of month (1 to 28, 29, 30, 31)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>Month</name>
                        <description>Month (1 to 12)</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCYEAR</name>
                  <displayName>YEAR</displayName>
                  <description>RTCYEAR Register  Hexadecimal Format</description>
                  <addressOffset>0x16</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000f000</resetMask>
                  <fields>
                    <field>
                        <name>YearLowByte</name>
                        <description>Year  low byte. Valid values for Year are 0 to 4095.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>YearHighByte</name>
                        <description>Year  high byte. Valid values for Year are 0 to 4095.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCAMINHR</name>
                  <displayName>AMINHR</displayName>
                  <description>RTCMINHR - Hexadecimal Format</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00006040</resetMask>
                  <fields>
                    <field>
                        <name>Minutes</name>
                        <description>Minutes (0 to 59)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x6</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MINAE</name>
                        <description>Alarm enable</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>Hours</name>
                        <description>Hours (0 to 23)</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HOURAE</name>
                        <description>Alarm enable</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCADOWDAY</name>
                  <displayName>ADOWDAY</displayName>
                  <description>RTCADOWDAY - Hexadecimal Format</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00006078</resetMask>
                  <fields>
                    <field>
                        <name>DayofWeek</name>
                        <description>Day of week (0 to 6)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOWAE</name>
                        <description>Alarm enable</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DayofMonth</name>
                        <description>Day of month (1 to 28, 29, 30, 31)</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DAYAE</name>
                        <description>Alarm enable</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
