cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
            <register>
                  <name>CSSETIFG</name>
                  <displayName>SETIFG</displayName>
                  <description>Set Interrupt Flag Register</description>
                  <addressOffset>0x58</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SET_LFXTIFG</name>
                        <description>Set LFXT oscillator fault interrupt flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_LFXTIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_LFXTIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_LFXTIFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_HFXTIFG</name>
                        <description>Set HFXT oscillator fault interrupt flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_HFXTIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_HFXTIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_HFXTIFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_HFXT2IFG</name>
                        <description>Set HFXT2 oscillator fault interrupt flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_HFXT2IFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_HFXT2IFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_HFXT2IFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_DCOR_OPNIFG</name>
                        <description>Set DCO external resistor open circuit fault interrupt flag.</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_DCOR_OPNIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_DCOR_OPNIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_DCOR_OPNIFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_CALIFG</name>
                        <description>REFCNT period counter set interrupt flag</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_CALIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_CALIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_CALIFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_FCNTHFIFG</name>
                        <description>Start fault counter set interrupt flag HFXT</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_FCNTHFIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_FCNTHFIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_FCNTHFIFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_FCNTHF2IFG</name>
                        <description>Start fault counter set interrupt flag HFXT2</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_FCNTHF2IFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_FCNTHF2IFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_FCNTHF2IFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_FCNTLFIFG</name>
                        <description>Start fault counter set interrupt flag LFXT</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_FCNTLFIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_FCNTLFIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_FCNTLFIFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_PLLOOLIFG</name>
                        <description>PLL out-of-lock set interrupt flag</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_PLLOOLIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_PLLOOLIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_PLLOOLIFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_PLLLOSIFG</name>
                        <description>PLL loss-of-signal set interrupt flag</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_PLLLOSIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_PLLLOSIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_PLLLOSIFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SET_PLLOORIFG</name>
                        <description>PLL out-of-range set interrupt flag</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>SET_PLLOORIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_PLLOORIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_PLLOORIFG_1</name>
                                <description>Set pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CSDCOERCAL0</name>
                  <displayName>DCOERCAL0</displayName>
                  <description>DCO External Resistor Cailbration 0 Register</description>
                  <addressOffset>0x60</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x01000000</resetValue>
                  <fields>
                    <field>
                        <name>DCO_TCCAL</name>
                        <description>DCO Temperature compensation calibration</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DCO_FCAL_RSEL04</name>
                        <description>DCO frequency calibration for DCO frequency range (DCORSEL) 0 to 4.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CSDCOERCAL1</name>
                  <displayName>DCOERCAL1</displayName>
                  <description>DCO External Resistor Calibration 1 Register</description>
                  <addressOffset>0x64</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000100</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DCO_FCAL_RSEL5</name>
                        <description>DCO frequency calibration for DCO frequency range (DCORSEL) 5.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
