cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>FLCTL_A</name>
        <version>356.0</version>
        <description>FLCTL_A</description>
        <baseAddress>0x40011000</baseAddress>
        <interrupt>
            <name>FLCTL_A_IRQ</name>
            <description>Flash Controller Interrupt</description>
            <value>5</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x260</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>FLCTL_POWER_STAT</name>
                  <displayName>POWER_STAT</displayName>
                  <description>Power Status Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000080</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>PSTAT</name>
                        <description>Flash power status</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PSTAT_0</name>
                                <description>Flash IP in power-down mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PSTAT_1</name>
                                <description>Flash IP Vdd domain power-up in progress</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PSTAT_2</name>
                                <description>PSS LDO_GOOD, IREF_OK and VREF_OK check in progress</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PSTAT_3</name>
                                <description>Flash IP SAFE_LV check in progress</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PSTAT_4</name>
                                <description>Flash IP Active</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PSTAT_5</name>
                                <description>Flash IP Active in Low-Frequency Active and Low-Frequency LPM0 modes.</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PSTAT_6</name>
                                <description>Flash IP in Standby mode</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PSTAT_7</name>
                                <description>Flash IP in Current mirror boost state</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LDOSTAT</name>
                        <description>PSS FLDO GOOD status</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LDOSTAT_0</name>
                                <description>FLDO not GOOD</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LDOSTAT_1</name>
                                <description>FLDO GOOD</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VREFSTAT</name>
                        <description>PSS VREF stable status</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>VREFSTAT_0</name>
                                <description>Flash LDO not stable</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VREFSTAT_1</name>
                                <description>Flash LDO stable</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IREFSTAT</name>
                        <description>PSS IREF stable status</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>IREFSTAT_0</name>
                                <description>IREF not stable</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>IREFSTAT_1</name>
                                <description>IREF stable</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TRIMSTAT</name>
                        <description>PSS trim done status</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TRIMSTAT_0</name>
                                <description>PSS trim not complete</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TRIMSTAT_1</name>
                                <description>PSS trim complete</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RD_2T</name>
                        <description>Indicates if Flash is being accessed in 2T mode</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RD_2T_0</name>
                                <description>Flash reads are in 1T mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_2T_1</name>
                                <description>Flash reads are in 2T mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_BANK0_RDCTL</name>
                  <displayName>BANK0_RDCTL</displayName>
                  <description>Bank0 Read Control Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>RD_MODE</name>
                        <description>Flash read mode control setting for Bank 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RD_MODE_0</name>
                                <description>Normal read mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_1</name>
                                <description>Read Margin 0</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_2</name>
                                <description>Read Margin 1</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_3</name>
                                <description>Program Verify</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_4</name>
                                <description>Erase Verify</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_5</name>
                                <description>Leakage Verify</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_9</name>
                                <description>Read Margin 0B</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_10</name>
                                <description>Read Margin 1B</description>
                                <value>10</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BUFI</name>
                        <description>Enables read buffering feature for instruction fetches to this Bank</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFD</name>
                        <description>Enables read buffering feature for data reads to this Bank</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WAIT</name>
                        <description>Number of wait states for read</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>WAIT_0</name>
                                <description>0 wait states</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_1</name>
                                <description>1 wait states</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_2</name>
                                <description>2 wait states</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_3</name>
                                <description>3 wait states</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_4</name>
                                <description>4 wait states</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_5</name>
                                <description>5 wait states</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_6</name>
                                <description>6 wait states</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_7</name>
                                <description>7 wait states</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_8</name>
                                <description>8 wait states</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_9</name>
                                <description>9 wait states</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_10</name>
                                <description>10 wait states</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_11</name>
                                <description>11 wait states</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_12</name>
                                <description>12 wait states</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_13</name>
                                <description>13 wait states</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_14</name>
                                <description>14 wait states</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_15</name>
                                <description>15 wait states</description>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RD_MODE_STATUS</name>
                        <description>Read mode</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_0</name>
                                <description>Normal read mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_1</name>
                                <description>Read Margin 0</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_2</name>
                                <description>Read Margin 1</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_3</name>
                                <description>Program Verify</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_4</name>
                                <description>Erase Verify</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_5</name>
                                <description>Leakage Verify</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_9</name>
                                <description>Read Margin 0B</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_10</name>
                                <description>Read Margin 1B</description>
                                <value>10</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
