cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
            <register>
                  <name>FLCTL_PRG_CTLSTAT</name>
                  <displayName>PRG_CTLSTAT</displayName>
                  <description>Program Control and Status Register</description>
                  <addressOffset>0x50</addressOffset>
                  <size>32</size>
                  <resetValue>0x0000000c</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Master control for all word program operations</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ENABLE_0</name>
                                <description>Word program operation disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLE_1</name>
                                <description>Word program operation enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>Write mode</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>MODE_0</name>
                                <description>Write immediate mode. Starts program operation immediately on each write to the Flash</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MODE_1</name>
                                <description>Full word write mode. Flash controller collates data over multiple writes to compose the full 128bit word before initiating the program operation</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VER_PRE</name>
                        <description>Controls automatic pre program verify operations</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>VER_PRE_0</name>
                                <description>No pre program verification</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VER_PRE_1</name>
                                <description>Pre verify feature automatically invoked for each write operation (irrespective of the mode)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VER_PST</name>
                        <description>Controls automatic post program verify operations</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>VER_PST_0</name>
                                <description>No post program verification</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>VER_PST_1</name>
                                <description>Post verify feature automatically invoked for each write operation (irrespective of the mode)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>STATUS</name>
                        <description>Status of program operations in the Flash memory</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>STATUS_0</name>
                                <description>Idle (no program operation currently active)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATUS_1</name>
                                <description>Single word program operation triggered, but pending</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATUS_2</name>
                                <description>Single word program in progress</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK_ACT</name>
                        <description>Bank active</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK_ACT_0</name>
                                <description>Word in Bank0 being programmed</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK_ACT_1</name>
                                <description>Word in Bank1 being programmed</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_CTLSTAT</name>
                  <displayName>PRGBRST_CTLSTAT</displayName>
                  <description>Program Burst Control and Status Register</description>
                  <addressOffset>0x54</addressOffset>
                  <size>32</size>
                  <resetValue>0x000000c0</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>START</name>
                        <description>Trigger start of burst program operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>TYPE</name>
                        <description>Type of memory that burst program is carried out on</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TYPE_0</name>
                                <description>Main Memory</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TYPE_1</name>
                                <description>Information Memory</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TYPE_3</name>
                                <description>Engineering Memory</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LEN</name>
                        <description>Length of burst</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LEN_0</name>
                                <description>No burst operation</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LEN_1</name>
                                <description>1 word burst of 128 bits, starting with address in the FLCTL_PRGBRST_STARTADDR Register</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LEN_2</name>
                                <description>2*128 bits burst write, starting with address in the FLCTL_PRGBRST_STARTADDR Register</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LEN_3</name>
                                <description>3*128 bits burst write, starting with address in the FLCTL_PRGBRST_STARTADDR Register</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LEN_4</name>
                                <description>4*128 bits burst write, starting with address in the FLCTL_PRGBRST_STARTADDR Register</description>
                                <value>4</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AUTO_PRE</name>
                        <description>Auto-Verify operation before the Burst Program</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AUTO_PRE_0</name>
                                <description>No program verify operations carried out</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AUTO_PRE_1</name>
                                <description>Causes an automatic Burst Program Verify after the Burst Program Operation</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AUTO_PST</name>
                        <description>Auto-Verify operation after the Burst Program</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AUTO_PST_0</name>
                                <description>No program verify operations carried out</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AUTO_PST_1</name>
                                <description>Causes an automatic Burst Program Verify before the Burst Program Operation</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BURST_STATUS</name>
                        <description>Status of a Burst Operation</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BURST_STATUS_0</name>
                                <description>Idle (Burst not active)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BURST_STATUS_1</name>
                                <description>Burst program started but pending</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BURST_STATUS_2</name>
                                <description>Burst active, with 1st 128 bit word being written into Flash</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BURST_STATUS_3</name>
                                <description>Burst active, with 2nd 128 bit word being written into Flash</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BURST_STATUS_4</name>
                                <description>Burst active, with 3rd 128 bit word being written into Flash</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BURST_STATUS_5</name>
                                <description>Burst active, with 4th 128 bit word being written into Flash</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BURST_STATUS_7</name>
                                <description>Burst Complete (status of completed burst remains in this state unless explicitly cleared by SW)</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PRE_ERR</name>
                        <description>Burst Operation encountered preprogram auto-verify errors</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PST_ERR</name>
                        <description>Burst Operation encountered postprogram auto-verify errors</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ADDR_ERR</name>
                        <description>Burst Operation was terminated due to attempted program of reserved memory</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLR_STAT</name>
                        <description>Clear status bits 21-16 of this register</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_STARTADDR</name>
                  <displayName>PRGBRST_STARTADDR</displayName>
                  <description>Program Burst Start Address Register</description>
                  <addressOffset>0x58</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>START_ADDRESS</name>
                        <description>Start Address of Program Burst Operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x16</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA0_0</name>
                  <displayName>PRGBRST_DATA0_0</displayName>
                  <description>Program Burst Data0 Register0</description>
                  <addressOffset>0x60</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA0_1</name>
                  <displayName>PRGBRST_DATA0_1</displayName>
                  <description>Program Burst Data0 Register1</description>
                  <addressOffset>0x64</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA0_2</name>
                  <displayName>PRGBRST_DATA0_2</displayName>
                  <description>Program Burst Data0 Register2</description>
                  <addressOffset>0x68</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA0_3</name>
                  <displayName>PRGBRST_DATA0_3</displayName>
                  <description>Program Burst Data0 Register3</description>
                  <addressOffset>0x6C</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA1_0</name>
                  <displayName>PRGBRST_DATA1_0</displayName>
                  <description>Program Burst Data1 Register0</description>
                  <addressOffset>0x70</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA1_1</name>
                  <displayName>PRGBRST_DATA1_1</displayName>
                  <description>Program Burst Data1 Register1</description>
                  <addressOffset>0x74</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
