cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ADC14CTL1</name>
                  <displayName>CTL1</displayName>
                  <description>Control 1 Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000030</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14PWRMD</name>
                        <description>ADC14 power modes</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14PWRMD_0</name>
                                <description>Regular power mode for use with any resolution setting. Sample rate can be up to 1 Msps.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14PWRMD_2</name>
                                <description>Low-power mode for 12-bit, 10-bit, and 8-bit resolution settings. Sample rate must not exceed 200 ksps.</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14REFBURST</name>
                        <description>ADC14 reference buffer burst</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14REFBURST_0</name>
                                <description>ADC reference buffer on continuously</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14REFBURST_1</name>
                                <description>ADC reference buffer on only during sample-and-conversion</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14DF</name>
                        <description>ADC14 data read-back format</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14DF_0</name>
                                <description>Binary unsigned. Theoretically, for ADC14DIF = 0 and 14-bit mode, the analog input voltage - V(REF) results in 0000h, and the analog input voltage + V(REF) results in 3FFFh</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14DF_1</name>
                                <description>Signed binary (2s complement), left aligned. Theoretically, for ADC14DIF = 0 and 14-bit mode, the analog input voltage - V(REF) results in 8000h, and the analog input voltage + V(REF) results in 7FFCh</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14RES</name>
                        <description>ADC14 resolution</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14RES_0</name>
                                <description>8 bit (9 clock cycle conversion time)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14RES_1</name>
                                <description>10 bit (11 clock cycle conversion time)</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14RES_2</name>
                                <description>12 bit (14 clock cycle conversion time)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14RES_3</name>
                                <description>14 bit (16 clock cycle conversion time)</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14CSTARTADD</name>
                        <description>ADC14 conversion start address</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADC14BATMAP</name>
                        <description>Controls 1/2 AVCC ADC input channel selection</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14BATMAP_0</name>
                                <description>ADC internal 1/2 x AVCC channel is not selected for ADC</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14BATMAP_1</name>
                                <description>ADC internal 1/2 x AVCC channel is selected for ADC input channel MAX</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14TCMAP</name>
                        <description>Controls temperature sensor ADC input channel selection</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14TCMAP_0</name>
                                <description>ADC internal temperature sensor channel is not selected for ADC</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14TCMAP_1</name>
                                <description>ADC internal temperature sensor channel is selected for ADC input channel MAX-1</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14CH0MAP</name>
                        <description>Controls internal channel 0 selection to ADC input channel MAX-2</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14CH0MAP_0</name>
                                <description>ADC input channel internal 0 is not selected</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14CH0MAP_1</name>
                                <description>ADC input channel internal 0 is selected for ADC input channel MAX-2</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14CH1MAP</name>
                        <description>Controls internal channel 1 selection to ADC input channel MAX-3</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14CH1MAP_0</name>
                                <description>ADC input channel internal 1 is not selected</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14CH1MAP_1</name>
                                <description>ADC input channel internal 1 is selected for ADC input channel MAX-3</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14CH2MAP</name>
                        <description>Controls internal channel 2 selection to ADC input channel MAX-4</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14CH2MAP_0</name>
                                <description>ADC input channel internal 2 is not selected</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14CH2MAP_1</name>
                                <description>ADC input channel internal 2 is selected for ADC input channel MAX-4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14CH3MAP</name>
                        <description>Controls internal channel 3 selection to ADC input channel MAX-5</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14CH3MAP_0</name>
                                <description>ADC input channel internal 3 is not selected</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14CH3MAP_1</name>
                                <description>ADC input channel internal 3 is selected for ADC input channel MAX-5</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ADC14LO0</name>
                  <displayName>LO0</displayName>
                  <description>Window Comparator Low Threshold 0 Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14LO0</name>
                        <description>Low threshold 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ADC14HI0</name>
                  <displayName>HI0</displayName>
                  <description>Window Comparator High Threshold 0 Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00003fff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14HI0</name>
                        <description>High threshold 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ADC14LO1</name>
                  <displayName>LO1</displayName>
                  <description>Window Comparator Low Threshold 1 Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14LO1</name>
                        <description>Low threshold 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ADC14HI1</name>
                  <displayName>HI1</displayName>
                  <description>Window Comparator High Threshold 1 Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00003fff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14HI1</name>
                        <description>High threshold 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
