cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG21_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG21_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG21_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG22</name>
                        <description>clear ADC14IFG22</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG22_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG22_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG22_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG23</name>
                        <description>clear ADC14IFG23</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG23_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG23_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG23_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG24</name>
                        <description>clear ADC14IFG24</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG24_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG24_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG24_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG25</name>
                        <description>clear ADC14IFG25</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG25_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG25_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG25_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG26</name>
                        <description>clear ADC14IFG26</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG26_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG26_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG26_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG27</name>
                        <description>clear ADC14IFG27</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG27_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG27_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG27_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG28</name>
                        <description>clear ADC14IFG28</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG28_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG28_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG28_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG29</name>
                        <description>clear ADC14IFG29</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG29_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG29_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG29_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG30</name>
                        <description>clear ADC14IFG30</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG30_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG30_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG30_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG31</name>
                        <description>clear ADC14IFG31</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG31_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG31_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG31_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ADC14CLRIFGR1</name>
                  <displayName>CLRIFGR1</displayName>
                  <description>Clear Interrupt Flag 1 Register</description>
                  <addressOffset>0x150</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLRADC14INIFG</name>
                        <description>clear ADC14INIFG</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14INIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14INIFG_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14INIFG_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14LOIFG</name>
                        <description>clear ADC14LOIFG</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14LOIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14LOIFG_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14LOIFG_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14HIIFG</name>
                        <description>clear ADC14HIIFG</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14HIIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14HIIFG_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14HIIFG_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14OVIFG</name>
                        <description>clear ADC14OVIFG</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14OVIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14OVIFG_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14OVIFG_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14TOVIFG</name>
                        <description>clear ADC14TOVIFG</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14TOVIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14TOVIFG_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14TOVIFG_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14RDYIFG</name>
                        <description>clear ADC14RDYIFG</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14RDYIFG_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14RDYIFG_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14RDYIFG_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
