cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
            <register>
                  <name>PFR0</name>
                  <displayName>PFR0</displayName>
                  <description>Processor Feature register0</description>
                  <addressOffset>0xD40</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000030</resetValue>
                  <fields>
                    <field>
                        <name>STATE0</name>
                        <description>State0 (T-bit == 0)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no ARM encoding</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>N/A</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>STATE1</name>
                        <description>State1 (T-bit == 1)</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>N/A</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>N/A</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>Thumb-2 encoding with the 16-bit basic instructions plus 32-bit Buncond/BL but no other 32-bit basic instructions (Note non-basic 32-bit instructions can be added using the appropriate instruction attribute, but other 32-bit basic instructions cannot.)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>Thumb-2 encoding with all Thumb-2 basic instructions</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PFR1</name>
                  <displayName>PFR1</displayName>
                  <description>Processor Feature register1</description>
                  <addressOffset>0xD44</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000200</resetValue>
                  <fields>
                    <field>
                        <name>MICROCONTROLLER_PROGRAMMERS_MODEL</name>
                        <description>Microcontroller programmer's model</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>not supported</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>two-stack support</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DFR0</name>
                  <displayName>DFR0</displayName>
                  <description>Debug Feature register0</description>
                  <addressOffset>0xD48</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00100000</resetValue>
                  <fields>
                    <field>
                        <name>MICROCONTROLLER_DEBUG_MODEL</name>
                        <description>Microcontroller Debug Model - memory mapped</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>not supported</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>Microcontroller debug v1 (ITMv1, DWTv1, optional ETM)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>AFR0</name>
                  <displayName>AFR0</displayName>
                  <description>Auxiliary Feature register0</description>
                  <addressOffset>0xD4C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
            </register>
            <register>
                  <name>MMFR0</name>
                  <displayName>MMFR0</displayName>
                  <description>Memory Model Feature register0</description>
                  <addressOffset>0xD50</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00100030</resetValue>
                  <fields>
                    <field>
                        <name>PMSA_SUPPORT</name>
                        <description>PMSA support</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>not supported</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>IMPLEMENTATION DEFINED (N/A)</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>PMSA base (features as defined for ARMv6) (N/A)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>PMSAv7 (base plus subregion support)</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CACHE_COHERENCE_SUPPORT</name>
                        <description>Cache coherence support</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no shared support</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>partial-inner-shared coherency (coherency amongst some - but not all - of the entities within an inner-coherent domain)</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>full-inner-shared coherency (coherency amongst all of the entities within an inner-coherent domain)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>full coherency (coherency amongst all of the entities)</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OUTER_NON_SHARABLE_SUPPORT</name>
                        <description>Outer non-sharable support</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>Outer non-sharable not supported</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>Outer sharable supported</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AUXILIARY_REGISTER_SUPPORT</name>
                        <description>Auxiliary register support</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>not supported</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>Auxiliary control register</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>MMFR1</name>
                  <displayName>MMFR1</displayName>
                  <description>Memory Model Feature register1</description>
                  <addressOffset>0xD54</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
            </register>
            <register>
                  <name>MMFR2</name>
                  <displayName>MMFR2</displayName>
                  <description>Memory Model Feature register2</description>
                  <addressOffset>0xD58</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>WAIT_FOR_INTERRUPT_STALLING</name>
                        <description>wait for interrupt stalling</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>not supported</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>wait for interrupt supported</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>MMFR3</name>
                  <displayName>MMFR3</displayName>
                  <description>Memory Model Feature register3</description>
                  <addressOffset>0xD5C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
            </register>
            <register>
                  <name>ISAR0</name>
                  <displayName>ISAR0</displayName>
                  <description>ISA Feature register0</description>
                  <addressOffset>0xD60</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x01141110</resetValue>
                  <fields>
                    <field>
                        <name>BITCOUNT_INSTRS</name>
                        <description>BitCount instructions</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no bit-counting instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds CLZ</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BITFIELD_INSTRS</name>
                        <description>BitField instructions</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no bitfield instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds BFC, BFI, SBFX, UBFX</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CMPBRANCH_INSTRS</name>
                        <description>CmpBranch instructions</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no combined compare-and-branch instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds CB{N}Z</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COPROC_INSTRS</name>
                        <description>Coprocessor instructions</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no coprocessor support, other than for separately attributed architectures such as CP15 or VFP</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds generic CDP, LDC, MCR, MRC, STC</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>adds generic CDP2, LDC2, MCR2, MRC2, STC2</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>adds generic MCRR, MRRC</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0100</name>
                                <description>adds generic MCRR2, MRRC2</description>
                                <value>4</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DEBUG_INSTRS</name>
                        <description>Debug instructions</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no debug instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds BKPT</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DIVIDE_INSTRS</name>
                        <description>Divide instructions</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no divide instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds SDIV, UDIV (v1 quotient only result)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
