cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
            <register>
                  <name>ISAR1</name>
                  <displayName>ISAR1</displayName>
                  <description>ISA Feature register1</description>
                  <addressOffset>0xD64</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x02112000</resetValue>
                  <fields>
                    <field>
                        <name>EXTEND_INSRS</name>
                        <description>Extend instructions. Note that the shift options on these instructions are also controlled by the WithShifts_instrs attribute.</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no scalar (i.e. non-SIMD) sign/zero-extend instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds SXTB, SXTH, UXTB, UXTH</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>N/A</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IFTHEN_INSTRS</name>
                        <description>IfThen instructions</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>IT instructions not present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds IT instructions (and IT bits in PSRs)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IMMEDIATE_INSTRS</name>
                        <description>Immediate instructions</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no special immediate-generating instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds ADDW, MOVW, MOVT, SUBW</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INTERWORK_INSTRS</name>
                        <description>Interwork instructions</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no interworking instructions supported</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds BX (and T bit in PSRs)</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>adds BLX, and PC loads have BX-like behavior</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>N/A</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ISAR2</name>
                  <displayName>ISAR2</displayName>
                  <description>ISA Feature register2</description>
                  <addressOffset>0xD68</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x21232231</resetValue>
                  <fields>
                    <field>
                        <name>LOADSTORE_INSTRS</name>
                        <description>LoadStore instructions</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no additional normal load/store instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds LDRD/STRD</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MEMHINT_INSTRS</name>
                        <description>MemoryHint instructions</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no memory hint instructions presen</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds PLD</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>adds PLD (ie a repeat on value 1)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>adds PLI</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MULTIACCESSINT_INSTRS</name>
                        <description>Multi-Access interruptible instructions</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>the (LDM/STM) instructions are non-interruptible</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>the (LDM/STM) instructions are restartable</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>the (LDM/STM) instructions are continuable</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MULT_INSTRS</name>
                        <description>Multiply instructions</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>only MUL present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds MLA</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>adds MLS</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MULTS_INSTRS</name>
                        <description>Multiply instructions (advanced, signed)</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no signed multiply instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds SMULL, SMLAL</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>N/A</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>N/A</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>MULTU_INSTRS</name>
                        <description>Multiply instructions (advanced, unsigned)</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no unsigned multiply instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds UMULL, UMLAL</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>N/A</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REVERSAL_INSTRS</name>
                        <description>Reversal instructions</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no reversal instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds REV, REV16, REVSH</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>adds RBIT</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ISAR3</name>
                  <displayName>ISAR3</displayName>
                  <description>ISA Feature register3</description>
                  <addressOffset>0xD6C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x01111131</resetValue>
                  <fields>
                    <field>
                        <name>SATRUATE_INSTRS</name>
                        <description>Saturate instructions</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no non-SIMD saturate instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>N/A</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SIMD_INSTRS</name>
                        <description>SIMD instructions</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no SIMD instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds SSAT, USAT (and the Q flag in the PSRs)</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>N/A</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SVC_INSTRS</name>
                        <description>SVC instructions</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no SVC (SWI) instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds SVC (SWI)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SYNCPRIM_INSTRS</name>
                        <description>SyncPrim instructions. Note there are no LDREXD or STREXD in ARMv7-M. This attribute is used in conjunction with the SyncPrim_instrs_frac attribute in ID_ISAR4[23:20].</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no synchronization primitives present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds LDREX, STREX</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>adds LDREXB, LDREXH, LDREXD, STREXB, STREXH, STREXD, CLREX(N/A)</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TABBRANCH_INSTRS</name>
                        <description>TableBranch instructions</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no table-branch instructions present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds TBB, TBH</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>THUMBCOPY_INSTRS</name>
                        <description>ThumbCopy instructions</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>Thumb MOV(register) instruction does not allow low reg -> low reg</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds Thumb MOV(register) low reg -> low reg and the CPY alias</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TRUENOP_INSTRS</name>
                        <description>TrueNOP instructions</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>true NOP instructions not present - that is, NOP instructions with no register dependencies</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds "true NOP", and the capability of additional "NOP compatible hints"</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
