cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
            <register>
                  <name>SYS_SRAM_BANKEN_CTL2</name>
                  <displayName>SRAM_BANKEN_CTL2</displayName>
                  <description>SRAM Bank Enable Control Register 2</description>
                  <addressOffset>0x58</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BNK64_EN</name>
                        <description>When 1, enables Bank64 of the SRAM</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK64_EN_0</name>
                                <description>Disables Bank64 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK64_EN_1</name>
                                <description>Enables Bank64 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK65_EN</name>
                        <description>When 1, enables Bank65 of the SRAM</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK65_EN_0</name>
                                <description>Disables Bank65 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK65_EN_1</name>
                                <description>Enables Bank65 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK66_EN</name>
                        <description>When 1, enables Bank66 of the SRAM</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK66_EN_0</name>
                                <description>Disables Bank66 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK66_EN_1</name>
                                <description>Enables Bank66 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK67_EN</name>
                        <description>When 1, enables Bank67 of the SRAM</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK67_EN_0</name>
                                <description>Disables Bank67 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK67_EN_1</name>
                                <description>Enables Bank67 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK68_EN</name>
                        <description>When 1, enables Bank68 of the SRAM</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK68_EN_0</name>
                                <description>Disables Bank68 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK68_EN_1</name>
                                <description>Enables Bank68 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK69_EN</name>
                        <description>When 1, enables Bank69 of the SRAM</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK69_EN_0</name>
                                <description>Disables Bank69 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK69_EN_1</name>
                                <description>Enables Bank69 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK70_EN</name>
                        <description>When 1, enables Bank70 of the SRAM</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK70_EN_0</name>
                                <description>Disables Bank70 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK70_EN_1</name>
                                <description>Enables Bank70 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK71_EN</name>
                        <description>When 1, enables Bank71 of the SRAM</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK71_EN_0</name>
                                <description>Disables Bank71 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK71_EN_1</name>
                                <description>Enables Bank71 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK72_EN</name>
                        <description>When 1, enables Bank72 of the SRAM</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK72_EN_0</name>
                                <description>Disables Bank72 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK72_EN_1</name>
                                <description>Enables Bank72 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK73_EN</name>
                        <description>When 1, enables Bank73 of the SRAM</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK73_EN_0</name>
                                <description>Disables Bank73 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK73_EN_1</name>
                                <description>Enables Bank73 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK74_EN</name>
                        <description>When 1, enables Bank74 of the SRAM</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK74_EN_0</name>
                                <description>Disables Bank74 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK74_EN_1</name>
                                <description>Enables Bank74 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK75_EN</name>
                        <description>When 1, enables Bank75 of the SRAM</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK75_EN_0</name>
                                <description>Disables Bank75 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK75_EN_1</name>
                                <description>Enables Bank75 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK76_EN</name>
                        <description>When 1, enables Bank76 of the SRAM</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK76_EN_0</name>
                                <description>Disables Bank76 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK76_EN_1</name>
                                <description>Enables Bank76 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK77_EN</name>
                        <description>When 1, enables Bank77 of the SRAM</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK77_EN_0</name>
                                <description>Disables Bank77 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK77_EN_1</name>
                                <description>Enables Bank77 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK78_EN</name>
                        <description>When 1, enables Bank78 of the SRAM</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK78_EN_0</name>
                                <description>Disables Bank78 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK78_EN_1</name>
                                <description>Enables Bank78 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK79_EN</name>
                        <description>When 1, enables Bank79 of the SRAM</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK79_EN_0</name>
                                <description>Disables Bank79 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK79_EN_1</name>
                                <description>Enables Bank79 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK80_EN</name>
                        <description>When 1, enables Bank80 of the SRAM</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK80_EN_0</name>
                                <description>Disables Bank80 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK80_EN_1</name>
                                <description>Enables Bank80 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK81_EN</name>
                        <description>When 1, enables Bank81 of the SRAM</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK81_EN_0</name>
                                <description>Disables Bank81 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK81_EN_1</name>
                                <description>Enables Bank81 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK82_EN</name>
                        <description>When 1, enables Bank82 of the SRAM</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK82_EN_0</name>
                                <description>Disables Bank82 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK82_EN_1</name>
                                <description>Enables Bank82 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK83_EN</name>
                        <description>When 1, enables Bank83 of the SRAM</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK83_EN_0</name>
                                <description>Disables Bank83 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK83_EN_1</name>
                                <description>Enables Bank83 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK84_EN</name>
                        <description>When 1, enables Bank84 of the SRAM</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK84_EN_0</name>
                                <description>Disables Bank84 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK84_EN_1</name>
                                <description>Enables Bank84 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK85_EN</name>
                        <description>When 1, enables Bank85 of the SRAM</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK85_EN_0</name>
                                <description>Disables Bank85 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK85_EN_1</name>
                                <description>Enables Bank85 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK86_EN</name>
                        <description>When 1, enables Bank86 of the SRAM</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK86_EN_0</name>
                                <description>Disables Bank86 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK86_EN_1</name>
                                <description>Enables Bank86 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK87_EN</name>
