cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401V.svd
            <register>
                  <name>SYS_SRAM_BLKRET_CTL1</name>
                  <displayName>SRAM_BLKRET_CTL1</displayName>
                  <description>SRAM Block Retention Control Register 1</description>
                  <addressOffset>0x74</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BLK32_EN</name>
                        <description>When 1, Block32 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK32_EN_0</name>
                                <description>Block32 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK32_EN_1</name>
                                <description>Block32 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK33_EN</name>
                        <description>When 1, Block33 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK33_EN_0</name>
                                <description>Block33 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK33_EN_1</name>
                                <description>Block33 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK34_EN</name>
                        <description>When 1, Block34 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK34_EN_0</name>
                                <description>Block34 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK34_EN_1</name>
                                <description>Block34 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK35_EN</name>
                        <description>When 1, Block35 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK35_EN_0</name>
                                <description>Block35 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK35_EN_1</name>
                                <description>Block35 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK36_EN</name>
                        <description>When 1, Block36 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK36_EN_0</name>
                                <description>Block36 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK36_EN_1</name>
                                <description>Block36 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK37_EN</name>
                        <description>When 1, Block37 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK37_EN_0</name>
                                <description>Block37 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK37_EN_1</name>
                                <description>Block37 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK38_EN</name>
                        <description>When 1, Block38 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK38_EN_0</name>
                                <description>Block38 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK38_EN_1</name>
                                <description>Block38 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK39_EN</name>
                        <description>When 1, Block39 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK39_EN_0</name>
                                <description>Block39 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK39_EN_1</name>
                                <description>Block39 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK40_EN</name>
                        <description>When 1, Block40 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK40_EN_0</name>
                                <description>Block40 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK40_EN_1</name>
                                <description>Block40 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK41_EN</name>
                        <description>When 1, Block41 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK41_EN_0</name>
                                <description>Block41 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK41_EN_1</name>
                                <description>Block41 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK42_EN</name>
                        <description>When 1, Block42 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK42_EN_0</name>
                                <description>Block42 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK42_EN_1</name>
                                <description>Block42 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK43_EN</name>
                        <description>When 1, Block43 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK43_EN_0</name>
                                <description>Block43 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK43_EN_1</name>
                                <description>Block43 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK44_EN</name>
                        <description>When 1, Block44 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK44_EN_0</name>
                                <description>Block44 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK44_EN_1</name>
                                <description>Block44 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK45_EN</name>
                        <description>When 1, Block45 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK45_EN_0</name>
                                <description>Block45 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK45_EN_1</name>
                                <description>Block45 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK46_EN</name>
                        <description>When 1, Block46 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK46_EN_0</name>
                                <description>Block46 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK46_EN_1</name>
                                <description>Block46 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK47_EN</name>
                        <description>When 1, Block47 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK47_EN_0</name>
                                <description>Block47 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK47_EN_1</name>
                                <description>Block47 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK48_EN</name>
                        <description>When 1, Block48 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK48_EN_0</name>
                                <description>Block48 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK48_EN_1</name>
                                <description>Block48 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK49_EN</name>
                        <description>When 1, Block49 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK49_EN_0</name>
                                <description>Block49 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK49_EN_1</name>
                                <description>Block49 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK50_EN</name>
                        <description>When 1, Block50 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK50_EN_0</name>
                                <description>Block50 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK50_EN_1</name>
                                <description>Block50 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK51_EN</name>
                        <description>When 1, Block51 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK51_EN_0</name>
                                <description>Block51 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK51_EN_1</name>
                                <description>Block51 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK52_EN</name>
                        <description>When 1, Block52 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK52_EN_0</name>
                                <description>Block52 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK52_EN_1</name>
                                <description>Block52 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK53_EN</name>
                        <description>When 1, Block53 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK53_EN_0</name>
                                <description>Block53 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
